In [2]:
import pandas as pd
s=pd.Series(['banana',42])
s #0과 1은 행인덱스

0    banana
1        42
dtype: object

In [3]:
s=pd.Series(['john','creator'])
print(s)

0    john
1    jane
dtype: object

In [18]:
s=pd.Series(['john','creator'],index=['name','job'])
print(s)

name       john
job     creator
dtype: object

In [19]:
friends=pd.DataFrame({
    'Name':['SE','Audrey'],
    'Occ':['Data Scientist','Actress'],
    'Born':['1994-03-18','1996-05-05'],
    'Age':['25','23']})
friends #######################

     Name             Occ        Born Age
0      SE  Data Scientist  1994-03-18  25
1  Audrey         Actress  1996-05-05  23

In [16]:
friends=pd.DataFrame({
    'Occ':['Data Scientist','Actress'],
    'Born':['1994-03-18','1996-05-05'],
    'Age':['25','23']}, index=['SE','Audrey'])
friends #소름!!!!!!!!!!!!이렇게 정리돼서 출력된거 보니까 너무 재밌다

                   Occ        Born Age
SE      Data Scientist  1994-03-18  25
Audrey         Actress  1996-05-05  23

In [23]:
#DataFrame의 순서가 뒤바뀌는 것을 방지하려면 OrderedDict
from collections import OrderedDict
friends=pd.DataFrame(OrderedDict([
    ('Name',['SE','Audrey']),
    ('Occ',['Data Scientist','Actress']),
    ('Born',['1994-03-18','1996-05-05']),
    ('Age',['25','23'])
])
                    )
friends

     Name             Occ        Born Age
0      SE  Data Scientist  1994-03-18  25
1  Audrey         Actress  1996-05-05  23

In [25]:
friends=pd.DataFrame({
    'Occ':['Data Scientist','Actress'],
    'Born':['1994-03-18','1996-05-05'],
    'Age':['25','23']}, 
    index=['SE','Audrey'],
columns=['Occ','Born','Age']
)
friends

                   Occ        Born Age
SE      Data Scientist  1994-03-18  25
Audrey         Actress  1996-05-05  23

In [26]:
first_row=friends.loc['Audrey']

In [27]:
first_row

Occ        Actress
Born    1996-05-05
Age             23
Name: Audrey, dtype: object

In [28]:
type(first_row)

pandas.core.series.Series

In [29]:
first_row.index

Index(['Occ', 'Born', 'Age'], dtype='object')

In [30]:
first_row.values #인덱스말고 값들만 뽑아보자

array(['Actress', '1996-05-05', '23'], dtype=object)

In [31]:
#속성이 아닌 메서드로 같은 작업 해보자
first_row.keys()

Index(['Occ', 'Born', 'Age'], dtype='object')

In [32]:
first_row.keys()[0] #dkkk......너무 재밌어 생각한대로 출력되는 거

'Occ'

In [34]:
first_row.index[0]

'Occ'

In [85]:
ages=friends['Age']

In [86]:
ages

SE        25
Audrey    23
Name: Age, dtype: object

In [77]:
print(ages)

[[True, True, False, False, True, True, False, True]]

In [87]:
ages.min()

'23'

In [89]:
ages.mean()################std?

1261.5

In [43]:
scientists=pd.read_csv("C:\\Users\\user\\data\\scientists.csv")

In [96]:
ages=scientists['Age']

In [97]:
ages.max()

90

In [98]:
ages.mean()

59.125

In [99]:
ages[ages>ages.mean()] #Boolean출력 for문 돌릴 필요 없이 벡터화 연산! 그리고 조건식을 만족하는 것만 출력?이를 인덱싱

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [100]:
manual_bool_values=[True,True,False,False,True,True,False,True]

In [101]:
ages[manual_bool_values]

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

In [65]:
import numpy as np

In [61]:
x1=np.array([[5.1],[3.5],[1.1],[0.2]])

In [62]:
print(x1) #4X1

[[5.1]
 [3.5]
 [1.1]
 [0.2]]

In [102]:
print(ages)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [103]:
print(ages+ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [104]:
print(ages*ages)
ages+100

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [105]:
pd.Series([1,100])

0      1
1    100
dtype: int64

In [106]:
ages+pd.Series([1,100]) #범위를 벗어나는 범위는 NaN으로

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [107]:
rev_ages=ages.sort_index(ascending=False)

In [108]:
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [109]:
print(scientists)

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [110]:
scientists[scientists['Age']>scientists['Age'].mean()] #평균보다 나이가 많은 데이터만 추출~~~~~~~와와와롸오ㅜ우우우잼써

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [113]:
scientists
# scientists.loc[[True,True,False,True]]

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [114]:
scientists*3 #값들이 3번씩~~~!~!~

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline FranklinRosaline Fra...,1920-07-251920-07-251920-07-25,1958-04-161958-04-161958-04-16,111,ChemistChemistChemist
1,William GossetWilliam GossetWilliam Gosset,1876-06-131876-06-131876-06-13,1937-10-161937-10-161937-10-16,183,StatisticianStatisticianStatistician
2,Florence NightingaleFlorence NightingaleFloren...,1820-05-121820-05-121820-05-12,1910-08-131910-08-131910-08-13,270,NurseNurseNurse
3,Marie CurieMarie CurieMarie Curie,1867-11-071867-11-071867-11-07,1934-07-041934-07-041934-07-04,198,ChemistChemistChemist
4,Rachel CarsonRachel CarsonRachel Carson,1907-05-271907-05-271907-05-27,1964-04-141964-04-141964-04-14,168,BiologistBiologistBiologist
5,John SnowJohn SnowJohn Snow,1813-03-151813-03-151813-03-15,1858-06-161858-06-161858-06-16,135,PhysicianPhysicianPhysician
6,Alan TuringAlan TuringAlan Turing,1912-06-231912-06-231912-06-23,1954-06-071954-06-071954-06-07,123,Computer ScientistComputer ScientistComputer S...
7,Johann GaussJohann GaussJohann Gauss,1777-04-301777-04-301777-04-30,1855-02-231855-02-231855-02-23,231,MathematicianMathematicianMathematician